import React from "react";
import { Link } from "react-router-dom";
import styles from "./BioPage.module.css";

export function BioPage(): React.ReactElement {
  return (
    <>
      <main
        style={{ padding: "80px 20px", maxWidth: "800px", margin: "0 auto" }}
      >
        <h1>Простір натхнення</h1>
        <p>
          Моя історія нерозривно пов’язана з Дніпром і мальовничим містом Ржищів
          на Київщині. Це моя Батьківщина, невелика, але надзвичайно привітна та
          культурно багата перлина, що славиться своїми художниками,
          композиторами, а також є рідним краєм для великої Ліни Костенко.
          <br /> <br />
          Саме в цьому містечку, де панує особлива атмосфера та живуть прекрасні
          люди, пройшли мої дитинство та юність. Тут я вперше відчув глибоке
          тяжіння до творчості. Одним із найулюбленіших занять у той час було
          навчання у музичній школі — фортепіано стало першою мовою, якою
          навчився висловлювати свої емоції. <br /> <br /> Хоча сьогодні живу та
          працюю в Києві, динамічному центрі, де розвиваю свою музичну
          діяльність, спогади про Ржищів назавжди залишилися моїм внутрішнім
          камертоном. Моє серце та душа завжди тягнуться туди, де живуть мої
          батьки та друзі. Я регулярно повертаюся додому, щоб відновити зв'язок
          із рідною землею та її неповторною енергетикою. <br /> <br />
          Музика, яка почалася як глибоке хобі, перетворилася на покликання
          надихати. Усі мої композиції — від медитативних акордів до енергійного
          електронного саунду — живляться цією любов'ю до рідного краю та вірою
          у краще. <br /> <br />
          Вірю, що моя музика знайде відгук у Ваших серцях і стане саундтреком
          для Ваших особистих досягнень. <br /> <br /> Я обов'язково повернуся
          до Ржищева. А поки що, дозвольте моїй музиці супроводжувати Вас у
          Вашій подорожі.
        </p>

        <Link
          to="/" // Повернення на головну сторінку
          className={styles.backButton} // !!! ЗАСТОСУВАННЯ СТИЛІВ !!!
        >
          ← На головну
        </Link>
      </main>
      {/* Можливо, Footer */}
    </>
  );
}
